{
    "basic_info": {
      "description_header": "Hi",
      "description": "👋 I'm Adnan Mohamud, a recent graduate of the University of Washington, where I earned a Bachelor of Science degree in Informatics with a concentration in Human-Computer Interaction. With a strong foundation in coding acquired through my coursework, I am eager to reintegrate myself into the world of software development. Driven by a profound passion for the field, I have always sought to contribute to innovative solutions and cutting-edge advancements. As I embark on this new phase of my professional journey, I am thrilled to be part of this class, as it provides a unique opportunity for me to broaden my skill set and stay ahead of industry trends.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Hungry Helper",
        "startDate": "2023",
        "description": "Our Mr. Al's HungryHelper app is a random restaurant generator. The user logs into their account. They fill out a form with price, location, and type of food as required criteria. When they hit submit, a Yelp API sends data to an array matching the criteria they requested. Then we use a random number generator to grab a random restaurant in the array to show to the user. The user can then hit make reservation which prompts them to fill out a form in order to make a reservation to the restaurant. The information entered will be uploaded to MongoDB and displayed on the reservations page. The user can also update and delete the reservation.",
        "images": [
          "images/portfolio/Hungry-Helper/hh-homepage.png",
          "images/portfolio/Hungry-Helper/hh-request-form.png",
          "images/portfolio/Hungry-Helper/hh-random-restaurant.png",
          "images/portfolio/Hungry-Helper/hh-reservation-form.png",
          "images/portfolio/Hungry-Helper/hh-about-us.png",
          "images/portfolio/Hungry-Helper/hh-account.png"
        ],
        "url": "https://mr-als-hungryhelper.netlify.app/",
        "technologies": [
          {
            "class": "devicon-react-plain",
            "name": "React"
          },
          {
            "class": "devicon-nodejs-plain",
            "name": "node"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS3"
          }
        ]
      },
      {
        "title": "City Explorer",
        "startDate": "2023",
        "description": "This application, City Explorer, is a web-based tool that allows users to explore weather forecast data and movies for different cities as well as its geographical information, including latitude, longitude, and a static map representation. The main problem domain addressed by this app is providing users with real-time weather information and movie details for locations of interest. By utilizing external APIs and displaying data in a user-friendly format, City Explorer simplifies the process of accessing weather and movie information. The application is built using React and utilizes the LocationIQ API to fetch data for the searched city.",
        "images": [
          "images/portfolio/City-Explorer/ce-search-city-map.png",
          "images/portfolio/City-Explorer/ce-top-movies-png.png"
        ],
        "url": "https://adnan-city-explorer.netlify.app/",
        "technologies": [
          {
            "class": "devicon-react-plain",
            "name": "React"
          },
          {
            "class": "devicon-nodejs-plain",
            "name": "node.js"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS3"
          }
        ]
      },
      {
        "title": "Glad Gaming",
        "startDate": "2023",
        "description": " This app is a Rock Paper Scissors game with a leaderboard that saves data after each round, and an About Us page. The gameplay will feature multiple opponents with different strategies and gambits, the goal is to get the most wins within a certain number of rounds, and then win against the highest number of opponents in a row.",
        "images": [
          "images/portfolio/glad-gaming/glad-games-home.png",
          "images/portfolio/glad-gaming/glad-games-leaderboard.png",
          "images/portfolio/glad-gaming/glad-gaming-about-us.png"
        ],
        "url": "https://glad-gaming.github.io/glad-games/",
        "technologies": [
          {
            "class": "devicon-html5-plain",
            "name": "HTML5"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS3"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Microsoft",
        "title": "New Technologist Intern",
        "years": "06.2018 - 08.2018",
        "mainTech": [
          "Swift",
          "Java",
          "Firebase"
        ],
        "technologies": [
          "REST API",
          "Swift",
          "Java",
          "Firebase",
          "Slack"
        ]
      }
    ]
  }
